// Переписать справочник абонентов (задание на структуры) со статического
// массива структур на динамический. При запуске программы массив пуст, при
// добавлении первого абонента выделяется память только под один элемент.
//
// По мере добавления абонентов массив увеличивается по одному элементу.
// При удалении, элемент, который удаляется, перемещается в конец массива и
// размер массива уменьшается на один элемент. По завершению программы память
// под массив высвобождается. В остальном функционал, как и в предыдущем
// задании//

#include "6_1_std.h"

int main() {
  Std_DirectoryMenu();
  return 0;
}
